package me.auburn.edu.alg4.ch4_1;

public class Config {
	public static final String NEWLINE = System.getProperty("line.separator");
	public static int[][] edges = { { 0, 5 }, { 4, 3 }, { 0, 1 }, { 9, 12 }, { 6, 4 }, { 5, 4 }, { 0, 2 }, { 11, 12 },
			{ 9, 10 }, { 0, 6 }, { 7, 8 }, { 9, 11 }, { 5, 3 } };
	public static int[][] noCycleEdges = { { 0, 2 }, { 2, 1 }, { 2, 3 }, { 3, 4 }, { 3, 5 } };
	/** 有向图的边 13个顶点 22条边 */
	public static int[][] directEdges = { 
			{ 4, 2 }, { 2, 3 }, { 3, 2 }, { 6, 0 }, 
			{ 0, 1 }, { 2, 0 }, { 11, 12 },
			{ 12, 9 }, { 9, 10 }, { 9, 11 }, { 8, 9 }, 
			{ 10, 12 }, { 11, 4 }, { 4, 3 }, { 3, 5 }, 
			{ 7, 8 }, { 8, 7 }, { 5, 4 }, { 0, 5 }, 
			{ 6, 4 }, { 6, 9 }, { 7, 6 } };
	public static double[][] directedWeightEdges = {
			{4, 5, 0.35},
			{4, 7, 0.37},
			{5, 7, 0.28},
			{0, 7, 0.16},
			{1, 5, 0.32},
			{0, 4, 0.38},
			{2, 3, 0.17},
			{1, 7, 0.19},
			{0, 2, 0.26},
			{1, 2, 0.36},
			{1, 3, 0.29},
			{2, 7, 0.34},
			{6, 2, 0.40},
			{3, 6, 0.52},
			{6, 0, 0.58},
			{6, 4, 0.93}
	};
}
